; domain
(define (domain blocksworld-4ops)
  (:requirements :strips)
  (:predicates
    (arm-empty)
    (holding ?x - block)
    (clear ?x - block)
    (on ?x - block ?y - block)
    (on-table ?x - block)
  )

  (:action pickup
    :parameters (?x - block)
    :precondition (and (arm-empty) (clear ?x) (on-table ?x))
    :effect (and (not (arm-empty)) (holding ?x) (not (clear ?x)) (not 
(on-table ?x)))
  )

  (:action putdown
    :parameters (?x - block)
    :precondition (holding ?x)
    :effect (and (arm-empty) (not (holding ?x)) (clear ?x) (on-table ?x))
  )

  (:action stack
    :parameters (?x - block ?y - block)
    :precondition (and (holding ?x) (clear ?y))
    :effect (and (arm-empty) (not (holding ?x)) (on ?x ?y) (clear ?x) (not 
(clear ?y)))
  )

  (:action unstack
    :parameters (?x - block ?y - block)
    :precondition (and (arm-empty) (on ?x ?y) (clear ?x))
    :effect (and (not (arm-empty)) (holding ?x) (clear ?y) (not (clear 
?x)) (not (on ?x ?y)))
  )
)

; problem
(define (problem complex-rearrange)
  (:domain blocksworld-4ops)
  (:objects A B C D - block)
  (:init (arm-empty)
         (on-table A) (on B A) (clear B)
         (on-table C) (on D C) (clear D))
  (:goal (and (on A B) (on B C) (on C D) (on-table D))))

; plan
1. (unstack d c)
   deleted: (arm-empty) (clear d) (on d c)
   added: (holding d) (clear c)
   goals met: 0 of 4
2. (putdown d)
   deleted: (holding d)
   added: (arm-empty) (clear d) (on-table d)
   goals met: 1 of 4
3. (pickup c)
   deleted: (arm-empty) (clear c) (on-table c)
   added: (holding c)
   goals met: 1 of 4
4. (stack c d)
   deleted: (holding c) (clear d)
   added: (arm-empty) (on c d) (clear c)
   goals met: 2 of 4
5. (unstack b a)
   deleted: (arm-empty) (clear b) (on b a)
   added: (holding b) (clear a)
   goals met: 2 of 4
6. (stack b c)
   deleted: (holding b) (clear c)
   added: (arm-empty) (on b c) (clear b)
   goals met: 3 of 4
7. (pickup a)
   deleted: (arm-empty) (clear a) (on-table a)
   added: (holding a)
   goals met: 3 of 4
8. (stack a b)
   deleted: (holding a) (clear b)
   added: (arm-empty) (on a b) (clear a)
   goals met: 4 of 4
